// re1nor, since December 2021

//Определение пакета
package main

// Импорт пакета format - реализует форматирование для входных и выходных данных //
import "fmt"

// Ключевое слово func + имя_функции(параметры) { тело функции }
// Функция main - вызывается сама при запуске программы
func main() {

	/* Доступ к функции пакета fmt под названием Println, затем создание новой строки,
	содержащей "Hello, World! ...", и вызов функции с этой строкой в качестве первого
	и единственного аргумента */
	fmt.Println("Hello, World! My name is Bulat and I started learning Go!")
}
